Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GB108.h
/*
** Only one invocation of CONFIG3 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set CONFIG3.
** Multiple options may be combined, as shown:
**
** _CONFIG3( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Write Protection Flash Page Segment Boundary:
**     WPFP_WPFP0           Page 0 (0x00)
**     WPFP_WPFP1           Page 1 (0x400)
**     WPFP_WPFP2           Page 2 (0x800)
**     WPFP_WPFP3           Page 3 (0xC00)
**     WPFP_WPFP4           Page 4 (0x1000)
**     WPFP_WPFP5           Page 5 (0x1400)
**     WPFP_WPFP6           Page 6 (0x1800)
**     WPFP_WPFP7           Page 7 (0x1C00)
**     WPFP_WPFP8           Page 8 (0x2000)
**     WPFP_WPFP9           Page 9 (0x2400)
**     WPFP_WPFP10          Page 10 (0x2800)
**     WPFP_WPFP11          Page 11 (0x2C00)
**     WPFP_WPFP12          Page 12 (0x3000)
**     WPFP_WPFP13          Page 13 (0x3400)
**     WPFP_WPFP14          Page 14 (0x3800)
**     WPFP_WPFP15          Page 15 (0x3C00)
**     WPFP_WPFP16          Page 16 (0x4000)
**     WPFP_WPFP17          Page 17 (0x4400)
**     WPFP_WPFP18          Page 18 (0x4800)
**     WPFP_WPFP19          Page 19 (0x4C00)
**     WPFP_WPFP20          Page 20 (0x5000)
**     WPFP_WPFP21          Page 21 (0x5400)
**     WPFP_WPFP22          Page 22 (0x5800)
**     WPFP_WPFP23          Page 23 (0x5C00)
**     WPFP_WPFP24          Page 24 (0x6000)
**     WPFP_WPFP25          Page 25 (0x6400)
**     WPFP_WPFP26          Page 26 (0x6800)
**     WPFP_WPFP27          Page 27 (0x6C00)
**     WPFP_WPFP28          Page 28 (0x7000)
**     WPFP_WPFP29          Page 29 (0x7400)
**     WPFP_WPFP30          Page 30 (0x7800)
**     WPFP_WPFP31          Page 31 (0x7C00)
**     WPFP_WPFP32          Page 32 (0x8000)
**     WPFP_WPFP33          Page 33 (0x8400)
**     WPFP_WPFP34          Page 34 (0x8800)
**     WPFP_WPFP35          Page 35 (0x8C00)
**     WPFP_WPFP36          Page 36 (0x9000)
**     WPFP_WPFP37          Page 37 (0x9400)
**     WPFP_WPFP38          Page 38 (0x9800)
**     WPFP_WPFP39          Page 39 (0x9C00)
**     WPFP_WPFP40          Page 40 (0xA000)
**     WPFP_WPFP41          Page 41 (0xA400)
**     WPFP_WPFP42          Page 42 (0xA800)
**     WPFP_WPFP43          Page 43 (0xAC00)
**     WPFP_WPFP44          Page 44 (0xB000)
**     WPFP_WPFP45          Page 45 (0xB400)
**     WPFP_WPFP46          Page 46 (0xB800)
**     WPFP_WPFP47          Page 47 (0xBC00)
**     WPFP_WPFP48          Page 48 (0xC000)
**     WPFP_WPFP49          Page 49 (0xC400)
**     WPFP_WPFP50          Page 50 (0xC800)
**     WPFP_WPFP51          Page 51 (0xCC00)
**     WPFP_WPFP52          Page 52 (0xD000)
**     WPFP_WPFP53          Page 53 (0xD400)
**     WPFP_WPFP54          Page 54 (0xD800)
**     WPFP_WPFP55          Page 55 (0xDC00)
**     WPFP_WPFP56          Page 56 (0xE000)
**     WPFP_WPFP57          Page 57 (0xE400)
**     WPFP_WPFP58          Page 58 (0xE800)
**     WPFP_WPFP59          Page 59 (0xEC00)
**     WPFP_WPFP60          Page 60 (0xF000)
**     WPFP_WPFP61          Page 61 (0xF400)
**     WPFP_WPFP62          Page 62 (0xF800)
**     WPFP_WPFP63          Page 63 (0xFC00)
**     WPFP_WPFP64          Page 64 (0x10000)
**     WPFP_WPFP65          Page 65 (0x10400)
**     WPFP_WPFP66          Page 66 (0x10800)
**     WPFP_WPFP67          Page 67 (0x10C00)
**     WPFP_WPFP68          Page 68 (0x11000)
**     WPFP_WPFP69          Page 69 (0x11400)
**     WPFP_WPFP70          Page 70 (0x11800)
**     WPFP_WPFP71          Page 71 (0x11C00)
**     WPFP_WPFP72          Page 72 (0x12000)
**     WPFP_WPFP73          Page 73 (0x12400)
**     WPFP_WPFP74          Page 74 (0x12800)
**     WPFP_WPFP75          Page 75 (0x12C00)
**     WPFP_WPFP76          Page 76 (0x13000)
**     WPFP_WPFP77          Page 77 (0x13400)
**     WPFP_WPFP78          Page 78 (0x13800)
**     WPFP_WPFP79          Page 79 (0x13C00)
**     WPFP_WPFP80          Page 80 (0x14000)
**     WPFP_WPFP81          Page 81 (0x14400)
**     WPFP_WPFP82          Page 82 (0x14800)
**     WPFP_WPFP83          Page 83 (0x14C00)
**     WPFP_WPFP84          Page 84 (0x15000)
**     WPFP_WPFP85          Page 85 (0x15400)
**     WPFP_WPFP511         Highest Page (same as page 85)
**
**   Segment Write Protection Disable bit:
**     WPDIS_WPEN           Segmented code protection enabled
**     WPDIS_WPDIS          Segmented code protection disabled
**
**   Configuration Word Code Page Protection Select bit:
**     WPCFG_WPCFGEN        Last page and Flash configuration words are code-protected
**     WPCFG_WPCFGDIS       Last page(at the top of program memory) and Flash configuration words are not protected
**
**   Segment Write Protection End Page Select bit:
**     WPEND_WPSTARTMEM     Write Protect from page 0 to WPFP
**     WPEND_WPENDMEM       Write Protect from WPFP to the last page of memory
**
*/

#define WPFP_WPFP0           0xFE00
#define WPFP_WPFP1           0xFE01
#define WPFP_WPFP2           0xFE02
#define WPFP_WPFP3           0xFE03
#define WPFP_WPFP4           0xFE04
#define WPFP_WPFP5           0xFE05
#define WPFP_WPFP6           0xFE06
#define WPFP_WPFP7           0xFE07
#define WPFP_WPFP8           0xFE08
#define WPFP_WPFP9           0xFE09
#define WPFP_WPFP10          0xFE0A
#define WPFP_WPFP11          0xFE0B
#define WPFP_WPFP12          0xFE0C
#define WPFP_WPFP13          0xFE0D
#define WPFP_WPFP14          0xFE0E
#define WPFP_WPFP15          0xFE0F
#define WPFP_WPFP16          0xFE10
#define WPFP_WPFP17          0xFE11
#define WPFP_WPFP18          0xFE12
#define WPFP_WPFP19          0xFE13
#define WPFP_WPFP20          0xFE14
#define WPFP_WPFP21          0xFE15
#define WPFP_WPFP22          0xFE16
#define WPFP_WPFP23          0xFE17
#define WPFP_WPFP24          0xFE18
#define WPFP_WPFP25          0xFE19
#define WPFP_WPFP26          0xFE1A
#define WPFP_WPFP27          0xFE1B
#define WPFP_WPFP28          0xFE1C
#define WPFP_WPFP29          0xFE1D
#define WPFP_WPFP30          0xFE1E
#define WPFP_WPFP31          0xFE1F
#define WPFP_WPFP32          0xFE20
#define WPFP_WPFP33          0xFE21
#define WPFP_WPFP34          0xFE22
#define WPFP_WPFP35          0xFE23
#define WPFP_WPFP36          0xFE24
#define WPFP_WPFP37          0xFE25
#define WPFP_WPFP38          0xFE26
#define WPFP_WPFP39          0xFE27
#define WPFP_WPFP40          0xFE28
#define WPFP_WPFP41          0xFE29
#define WPFP_WPFP42          0xFE2A
#define WPFP_WPFP43          0xFE2B
#define WPFP_WPFP44          0xFE2C
#define WPFP_WPFP45          0xFE2D
#define WPFP_WPFP46          0xFE2E
#define WPFP_WPFP47          0xFE2F
#define WPFP_WPFP48          0xFE30
#define WPFP_WPFP49          0xFE31
#define WPFP_WPFP50          0xFE32
#define WPFP_WPFP51          0xFE33
#define WPFP_WPFP52          0xFE34
#define WPFP_WPFP53          0xFE35
#define WPFP_WPFP54          0xFE36
#define WPFP_WPFP55          0xFE37
#define WPFP_WPFP56          0xFE38
#define WPFP_WPFP57          0xFE39
#define WPFP_WPFP58          0xFE3A
#define WPFP_WPFP59          0xFE3B
#define WPFP_WPFP60          0xFE3C
#define WPFP_WPFP61          0xFE3D
#define WPFP_WPFP62          0xFE3E
#define WPFP_WPFP63          0xFE3F
#define WPFP_WPFP64          0xFE40
#define WPFP_WPFP65          0xFE41
#define WPFP_WPFP66          0xFE42
#define WPFP_WPFP67          0xFE43
#define WPFP_WPFP68          0xFE44
#define WPFP_WPFP69          0xFE45
#define WPFP_WPFP70          0xFE46
#define WPFP_WPFP71          0xFE47
#define WPFP_WPFP72          0xFE48
#define WPFP_WPFP73          0xFE49
#define WPFP_WPFP74          0xFE4A
#define WPFP_WPFP75          0xFE4B
#define WPFP_WPFP76          0xFE4C
#define WPFP_WPFP77          0xFE4D
#define WPFP_WPFP78          0xFE4E
#define WPFP_WPFP79          0xFE4F
#define WPFP_WPFP80          0xFE50
#define WPFP_WPFP81          0xFE51
#define WPFP_WPFP82          0xFE52
#define WPFP_WPFP83          0xFE53
#define WPFP_WPFP84          0xFE54
#define WPFP_WPFP85          0xFE55
#define WPFP_WPFP511         0xFFFF

#define WPDIS_WPEN           0xDFFF
#define WPDIS_WPDIS          0xFFFF

#define WPCFG_WPCFGEN        0xBFFF
#define WPCFG_WPCFGDIS       0xFFFF

